摘  要  I
Abstract  II

第一章 绪论  1
课题研究背景 
课题研究内容 
课题研究的意义  
本论文结构安排  

第二章 程序相关技术介绍  
机器学习简介  
应用程序层 
Content Provider  
mangoDB简介  
Vue简介  
vue工具包 
node 
本章小结 

第三章 程序总体设计  
程序流程图  
程序功能模块 11
文件选择  11
文件分析  11
数据存储  12
登陆注册功能  16
数据随机功能  16
推荐功能  17
搜索功能 18
统计数据功能  16

3.4  本章小结 19

第四章 数据库选择及设计  20
4.1  数据库对比与选择 20
4.2  数据库设计  20
4.3  SQL相关语句  21
4.4  本章小结 21

第五章 界面设计与实现 22
5.1  主界面  22
5.2  推荐页面 23
5.3  统计界面 25
5.4  搜索界面 26
5.5  详情界面 26
5.6  登陆注册界面 26
5.7  本章小结 26

第六章 总结与展望 27
6.1  总结 27
6.2  展望 28
6.3  本章小节 28

参考文献  29
致 谢 30


